{
  "token_to_idx": {
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "<UNK>": 3,
    "#": 4,
    "(": 5,
    ")": 6,
    "-": 7,
    ".": 8,
    "1": 9,
    "2": 10,
    "3": 11,
    "4": 12,
    "5": 13,
    "6": 14,
    "7": 15,
    "8": 16,
    "=": 17,
    "Br": 18,
    "C": 19,
    "Cl": 20,
    "F": 21,
    "I": 22,
    "N": 23,
    "O": 24,
    "P": 25,
    "S": 26,
    "[Br-]": 27,
    "[C+]": 28,
    "[C-]": 29,
    "[Cl+3]": 30,
    "[Cl-]": 31,
    "[H]": 32,
    "[I-]": 33,
    "[N+]": 34,
    "[N-]": 35,
    "[O-]": 36,
    "[P+]": 37,
    "[PH]": 38,
    "[S+]": 39,
    "[S-]": 40,
    "[n+]": 41,
    "[n-]": 42,
    "[nH]": 43,
    "[o+]": 44,
    "[s+]": 45,
    "c": 46,
    "n": 47,
    "o": 48,
    "s": 49
  },
  "idx_to_token": {
    "0": "<PAD>",
    "1": "<START>",
    "2": "<END>",
    "3": "<UNK>",
    "4": "#",
    "5": "(",
    "6": ")",
    "7": "-",
    "8": ".",
    "9": "1",
    "10": "2",
    "11": "3",
    "12": "4",
    "13": "5",
    "14": "6",
    "15": "7",
    "16": "8",
    "17": "=",
    "18": "Br",
    "19": "C",
    "20": "Cl",
    "21": "F",
    "22": "I",
    "23": "N",
    "24": "O",
    "25": "P",
    "26": "S",
    "27": "[Br-]",
    "28": "[C+]",
    "29": "[C-]",
    "30": "[Cl+3]",
    "31": "[Cl-]",
    "32": "[H]",
    "33": "[I-]",
    "34": "[N+]",
    "35": "[N-]",
    "36": "[O-]",
    "37": "[P+]",
    "38": "[PH]",
    "39": "[S+]",
    "40": "[S-]",
    "41": "[n+]",
    "42": "[n-]",
    "43": "[nH]",
    "44": "[o+]",
    "45": "[s+]",
    "46": "c",
    "47": "n",
    "48": "o",
    "49": "s"
  },
  "vocab": [
    "<PAD>",
    "<START>",
    "<END>",
    "<UNK>",
    "#",
    "(",
    ")",
    "-",
    ".",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "=",
    "Br",
    "C",
    "Cl",
    "F",
    "I",
    "N",
    "O",
    "P",
    "S",
    "[Br-]",
    "[C+]",
    "[C-]",
    "[Cl+3]",
    "[Cl-]",
    "[H]",
    "[I-]",
    "[N+]",
    "[N-]",
    "[O-]",
    "[P+]",
    "[PH]",
    "[S+]",
    "[S-]",
    "[n+]",
    "[n-]",
    "[nH]",
    "[o+]",
    "[s+]",
    "c",
    "n",
    "o",
    "s"
  ],
  "vocab_size": 50,
  "tokenizer": "regex",
  "mode": "pretrain"
}